GNU gdb (Ubuntu 7.11.1-0ubuntu1~16.5) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from cardtest1...done.
(gdb) break a[Ksmithye[KEffect 
Breakpoint 1 at 0x403bc5: file dominion.c, line 655.
(gdb) c[Krun 
Starting program: /home/grejuca/CS362-W2019/projects/grejuca/siekmanjDominion/cardtest1 

Breakpoint 1, smithyEffect (currentPlayer=0, state=0x7fffffff74a0, handPos=0) at dominion.c:655
655		for (int i = 0; i <= 3; i++){  
(gdb) b[Kprint handC
handCard   handCount  
(gdb) print handC[K[K[K[K[Kstate->hna[K[KandCount 
$1 = {5, 0, 0, 0}
(gdb) watch handCount
(gdb) watch state->handCount
Hardware watchpoint 2: state->handCount
(gdb) break carf[KdEffect 
Breakpoint 3 at 0x4045bf: file dominion.c, line 808.
(gdb) c
Continuing.

Hardware watchpoint 2: state->handCount

Old value = {5, 0, 0, 0}
New value = {6, 0, 0, 0}
0x0000000000403853 in drawCard (player=0, state=0x7fffffff74a0) at dominion.c:581
581			state->handCount[player]++;//Increment hand count
(gdb) c
Continuing.

Hardware watchpoint 2: state->handCount

Old value = {6, 0, 0, 0}
New value = {7, 0, 0, 0}
0x0000000000403853 in drawCard (player=0, state=0x7fffffff74a0) at dominion.c:581
581			state->handCount[player]++;//Increment hand count
(gdb) c[Kbavktrace
(gdb) bak[Kcktrace
#0  0x0000000000403853 in drawCard (player=0, state=0x7fffffff74a0) at dominion.c:581
#1  0x0000000000403bf1 in smithyEffect (currentPlayer=0, state=0x7fffffff74a0, handPos=0) at dominion.c:656
#2  0x000000000040493c in cardEffect (card=13, choice1=0, choice2=0, choice3=0, state=0x7fffffff74a0, handPos=0, bonus=0x7fffffff0d7c) at dominion.c:870
#3  0x000000000040120d in main () at cardtest1.c:35
(gdb) backtracevktrace[C[C[C[C[C[Cc[K
Continuing.

Hardware watchpoint 2: state->handCount

Old value = {7, 0, 0, 0}
New value = {8, 0, 0, 0}
0x0000000000403853 in drawCard (player=0, state=0x7fffffff74a0) at dominion.c:581
581			state->handCount[player]++;//Increment hand count
(gdb) 
Continuing.

Hardware watchpoint 2: state->handCount

Old value = {8, 0, 0, 0}
New value = {9, 0, 0, 0}
0x0000000000403853 in drawCard (player=0, state=0x7fffffff74a0) at dominion.c:581
581			state->handCount[player]++;//Increment hand count
(gdb) 
Continuing.

Hardware watchpoint 2: state->handCount

Old value = {9, 0, 0, 0}
New value = {8, 0, 0, 0}
0x0000000000406521 in discardCard (handPos=0, currentPlayer=0, state=0x7fffffff74a0, trashFlag=0) at dominion.c:1288
1288				state->handCount[currentPlayer]--;
(gdb) 
Continuing.

Watchpoint 2 deleted because the program has left the block in
which its expression is valid.
0x000000000040493c in cardEffect (card=13, choice1=0, choice2=0, choice3=0, state=0x7fffffff74a0, handPos=0, bonus=0x7fffffff0d7c) at dominion.c:870
870				return smithyEffect(currentPlayer, state, handPos);
(gdb) 